ПутьКФайлуСообщений = АргументыКоманднойСтроки[0];
п2 = АргументыКоманднойСтроки[1];

Если п2="merge" Тогда

	ЧТ = Новый ЧтениеТекста(ПутьКФайлуСообщений);
	АвтоСообщение = ЧТ.Прочитать();
	ЧТ.Закрыть();
	
	АвтоСообщение = СтрЗаменить(АвтоСообщение, "Merge branch '", "");
	АвтоСообщение = СтрЗаменить(АвтоСообщение, "'", "");
	АвтоСообщение = СокрЛП(АвтоСообщение);
	
	Сообщить(АвтоСообщение);
	
КонецЕсли;	

Сообщить(ТекущийКаталог() + " " + ПутьКФайлуСообщений);
Сообщить(п2);

ФайлСообщений = Новый Файл(ПутьКФайлуСообщений);

ПроцессГит = Создатьпроцесс("git cherry -v HEAD " + ?(п2="merge", АвтоСообщение, "MERGE_HEAD")
							,ТекущийКаталог()
							,Истина
							,Ложь
							,КодировкаТекста.UTF8);
ПроцессГит.Запустить();										
ПроцессГит.ОжидатьЗавершения();

ТестСообщения  = ПроцессГит.ПотокВывода.Прочитать();

Сообщить(ТестСообщения);

МассивСтрокКомиитов = СтрРазделить(ТестСообщения, Символы.ВК+Символы.ПС, Ложь);
НовыйМассивСтрокКомиитов = Новый Массив;
Для каждого СтрокаКомита из МассивСтрокКомиитов Цикл


	МассивСтрок = СтрРазделить(СтрокаКомита, " ", Ложь);
	МассивСтрок.Удалить(0);
	МассивСтрок.Удалить(0);
	НовыйМассивСтрокКомиитов.Добавить(СтрСоединить(МассивСтрок, " "));
	
КонецЦикла;

ТестСообщения = СтрСоединить(НовыйМассивСтрокКомиитов, Символы.ПС);

Сообщить(ТестСообщения);

ЗТ = Новый ЗаписьТекста(ПутьКФайлуСообщений);
ЗТ.ЗаписатьСтроку(ТестСообщения);
ЗТ.Закрыть();
